wso2/iskm-mcm/scripts/serviceProviders/updateApplication.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:xsd="http://org.apache.axis2/xsd" xmlns:xsd1="http://model.common.application.identity.carbon.wso2.org/xsd" xmlns:xsd2="http://script.model.common.application.identity.carbon.wso2.org/xsd">
   <soap:Header/>
   <soap:Body>
      <xsd:updateApplication>
         <xsd:serviceProvider>
            <xsd1:applicationID>@appid@</xsd1:applicationID>
            <xsd1:applicationName>@appname@</xsd1:applicationName>
            <xsd1:certificateContent/>
            <xsd1:claimConfig>
               <xsd1:alwaysSendMappedLocalSubjectId>false</xsd1:alwaysSendMappedLocalSubjectId>
               <xsd1:claimMappings>
                  <xsd1:localClaim>
                     <xsd1:claimUri>http://wso2.org/claims/2fa-enrolled</xsd1:claimUri>
                  </xsd1:localClaim>
                  <xsd1:mandatory>true</xsd1:mandatory>
                  <xsd1:remoteClaim>
                     <xsd1:claimUri>2fa-enrolled</xsd1:claimUri>
                  </xsd1:remoteClaim>
                  <xsd1:requested>true</xsd1:requested>
               </xsd1:claimMappings>
               <xsd1:claimMappings>
                  <xsd1:localClaim>
                     <xsd1:claimUri>http://wso2.org/claims/role</xsd1:claimUri>
                  </xsd1:localClaim>
                  <xsd1:mandatory>true</xsd1:mandatory>
                  <xsd1:remoteClaim>
                     <xsd1:claimUri>role</xsd1:claimUri>
                  </xsd1:remoteClaim>
                  <xsd1:requested>true</xsd1:requested>
               </xsd1:claimMappings>
               <xsd1:claimMappings>
                  <xsd1:localClaim>
                     <xsd1:claimUri>http://wso2.org/claims/identity/askPassword</xsd1:claimUri>
                  </xsd1:localClaim>
                  <xsd1:mandatory>true</xsd1:mandatory>
                  <xsd1:remoteClaim>
                     <xsd1:claimUri>askPassword</xsd1:claimUri>
                  </xsd1:remoteClaim>
                  <xsd1:requested>true</xsd1:requested>
               </xsd1:claimMappings>
               <!--Optional:-->
               <xsd1:localClaimDialect>true</xsd1:localClaimDialect>
               <!--Optional:-->
               <xsd1:roleClaimURI>role</xsd1:roleClaimURI>
               <!--Optional:-->
               <xsd1:userClaimURI>user</xsd1:userClaimURI>
               <xsd1:subjectClaimUri>http://wso2.org/claims/username</xsd1:subjectClaimUri>
            </xsd1:claimConfig>
            <!--Optional:-->
            <xsd1:description>Authentication service provider for MCM portal</xsd1:description>
            <xsd1:inboundAuthenticationConfig>
               <xsd1:inboundAuthenticationRequestConfigs>
                  <xsd1:friendlyName/>
                  <xsd1:inboundAuthKey>MCM_portal</xsd1:inboundAuthKey>
                  <xsd1:inboundAuthType>passivests</xsd1:inboundAuthType>
                  <xsd1:inboundConfigType>standardAPP</xsd1:inboundConfigType>
                  <xsd1:inboundConfiguration/>
               </xsd1:inboundAuthenticationRequestConfigs>
               <xsd1:inboundAuthenticationRequestConfigs>
                  <xsd1:friendlyName/>
                  <xsd1:inboundAuthKey>@authkey@</xsd1:inboundAuthKey>
                  <xsd1:inboundAuthType>oauth2</xsd1:inboundAuthType>
                  <xsd1:inboundConfigType>standardAPP</xsd1:inboundConfigType>
                  <xsd1:inboundConfiguration/>
                  <xsd1:properties>
                     <xsd1:advanced>false</xsd1:advanced>
                     <xsd1:confidential>false</xsd1:confidential>
                     <xsd1:defaultValue/>
                     <xsd1:description/>
                     <xsd1:displayName/>
                     <xsd1:displayOrder>0</xsd1:displayOrder>
                     <xsd1:name>oauthConsumerSecret</xsd1:name>
                     <xsd1:required>false</xsd1:required>
                     <xsd1:type/>
                     <xsd1:value>@secret@</xsd1:value>
                  </xsd1:properties>
               </xsd1:inboundAuthenticationRequestConfigs>
               <xsd1:inboundAuthenticationRequestConfigs>
                  <xsd1:friendlyName/>
                  <xsd1:inboundAuthKey>MCM_portal</xsd1:inboundAuthKey>
                  <xsd1:inboundAuthType>openid</xsd1:inboundAuthType>
                  <xsd1:inboundConfigType>standardAPP</xsd1:inboundConfigType>
                  <xsd1:inboundConfiguration/>
               </xsd1:inboundAuthenticationRequestConfigs> 
            </xsd1:inboundAuthenticationConfig>
            <xsd1:inboundProvisioningConfig>
               <xsd1:provisioningEnabled>false</xsd1:provisioningEnabled>
               <xsd1:provisioningUserStore>PRIMARY</xsd1:provisioningUserStore>
            </xsd1:inboundProvisioningConfig>
            <xsd1:localAndOutBoundAuthenticationConfig>
               <xsd1:alwaysSendBackAuthenticatedListOfIdPs>false</xsd1:alwaysSendBackAuthenticatedListOfIdPs>
               <xsd1:authenticationStepForAttributes></xsd1:authenticationStepForAttributes>
               <xsd1:authenticationStepForSubject>http://wso2.org/claims/username</xsd1:authenticationStepForSubject>
               <xsd1:authenticationType>default</xsd1:authenticationType>
               <xsd1:subjectClaimUri>http://wso2.org/claims/username</xsd1:subjectClaimUri>
               <xsd1:useTenantDomainInLocalSubjectIdentifier>false</xsd1:useTenantDomainInLocalSubjectIdentifier>
               <xsd1:useUserstoreDomainInLocalSubjectIdentifier>false</xsd1:useUserstoreDomainInLocalSubjectIdentifier>
               <xsd1:useUserstoreDomainInRoles>true</xsd1:useUserstoreDomainInRoles>
            </xsd1:localAndOutBoundAuthenticationConfig>
            <xsd1:owner>
               <xsd1:tenantDomain>carbon.super</xsd1:tenantDomain>
               <xsd1:userName>admin</xsd1:userName>
               <xsd1:userStoreDomain>PRIMARY</xsd1:userStoreDomain>
            </xsd1:owner>
            <xsd1:permissionAndRoleConfig></xsd1:permissionAndRoleConfig>
            <xsd1:saasApp>false</xsd1:saasApp>
            <xsd1:spProperties>
               <xsd1:displayName>DOMAIN_IN_ROLES</xsd1:displayName>
               <xsd1:name>USE_DOMAIN_IN_ROLES</xsd1:name>
               <xsd1:value>true</xsd1:value>
            </xsd1:spProperties>
         </xsd:serviceProvider>
      </xsd:updateApplication>
   </soap:Body>
</soap:Envelope>